packages/archaea-simulation/archaea_simulation-1.0.9-py3-none-any.whl/archaea_simulation/cfd/case/system/surfaceFeaturesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version	2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeaturesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

inlet
{
	surfaces
	(
		"inlet.stl"
	);
	
	includedAngle	180;
	
	writeObj	yes;
}

outlet
{
	surfaces
	(
		"outlet.stl"
	);
	
	includedAngle	180;
	
	writeObj	yes;
}

context
{
	surfaces
	(
		"context.stl"
	);
	
	includedAngle	180;
	
	writeObj	yes;
	
	
}

sides
{
	surfaces
	(
		"sides.stl"
	);
	
	includedAngle	180;
	
	writeObj	yes;
}

#includeEtc "caseDicts/surface/surfaceFeaturesDict.cfg"

// ************************************************************************* //
